// 1-10         20
// 11-50        10
// 51-100       9
// 101-200      8
// 201-500      7
// 501-1000     6
// 1001-2000    5
// 2001-3000    4
// 3001-4000    3
// 4001-5000    2
// >5000        1

// let arr = [10, 50, 100, 200, 500, 1000, 2000, 3000, 4000, 5000];
// let sumArr = [200, 400, 450, 800, 2100, 3000, 5000, 4000, 3000, 2000];

// let n = 1002;

// let arr2 = [20, 10, 9, 8, 7, 6, 5, 4, 3, 2];
// function compute(n) {
//   let temp = arr.findIndex((v) => {
//     return n <= v;
//   });

//   let res =
//     sumArr.slice(0, temp).reduce((a, b) => a + b, 0) +
//     (n - arr[temp - 1]) * arr2[temp];
//   return res;
// }

// console.log(compute(n));

// 有A、B两桶颜料，两桶容量都一样，
// A桶颜色为红色，B桶颜色为蓝色，
// 用一勺子从A桶舀一勺颜料到B桶(过程假设没有损耗，颜料能均匀混合)，
// 然后再从B桶舀一勺颜料到A桶，
// 求问A桶的蓝红颜料比例和B桶的红蓝颜料比例相比，
// 是大于、等于还是小于的关系。
